content/306.3_ES221_Fall2025.org
#+TITLE: ES 221: Mechanics of Solids - Fall 2025
# #+OPTIONS: 
#+OPTIONS: toc:1

* Basic Information
|-------------------+------------------------------------------|
| Class timings     | G1, G2: Tuesday, Friday, 11:30-12:50 hrs |
| Class location    | AB 7/101                                 |
|-------------------+------------------------------------------|
| Instructor        | Gaurav Srivastava (gauravs@iitgn.ac.in)  |
|-------------------+------------------------------------------|
| Tutorial timings  | Wednesday, 21:00-22:20 hrs               |
| Tutorial location | AB 7/101                                 |
|-------------------+------------------------------------------|
| TAs               | Yajat Sharma (yajat.sharma@iitgn.ac.in)  |
|                   | Kritika Rai (kritika.rai@iitgn.ac.in)    |
|-------------------+------------------------------------------|


* Course objectives, syllabus, books, pre-requisites
** Objectives
- To learn how materials behave in engineering applications.
- To learn how small and large natural and engineered systems remain stable/fail.
- To get an idea about design and analysis of different systems such as dams, buildings, bridges, etc.
	
** Syllabus
- Free body diagram, Modeling of supports, Conditions for Equilibrium.
- Friction Force-deformation relationship and geometric compatibility (for small deformations) with illustrations through simple problems on axially loaded members and thin walled pressure vessels.
- Axial force, shear force, bending moment, and twisting moment diagrams of slender members.
- Concept of stress and strain at a point, Transformation of stresses and strain at a point, Principal stresses and strains, Mohr’s circle (only for plane stress and strain case).
- Displacement field, Strain Rosette, Modeling of problem as a plane stress or plane strain problem.
- Discussion of experimental results on 1-D material behavior.
- Concepts of elasticity, plasticity, strain-hardening, failure (fracture/yielding), idealization of 1-D stress-strain curve, Concepts of isotropy, orthotropy, anisotropy.
- Generalized Hooke’s law, (without and with thermal strains).
- Torsion of circular shafts and thin-walled tubes.
- Bending of beams with symmetric cross-section (normal and shear stresses), Combined stresses, Yield criteria, Deflection due to bending.
- Integration of the moment-curvature relationship for simple boundary conditions, Super position principle.
- Concepts of strain energy and complementary strain energy for simple structural elements (those under axial load, shear force, bending moment, and torsion).
- Castigliano’s theorems for deflection analysis and indeterminate problems.
- Concept of elastic instability and a brief introduction to column buckling and Euler’s formula. 
		
** Textbook
- *B1*: Engineering Mechanics: Statics - R.C. Hibbeler (14th edition).
- *B2*: Mechanics of Materials - R.C. Hibbeler (10th edition).
# comment
	
** Reference Books
- Strength of Materials - S. Timoshenko.

** Pre-requisites
- Good background in Mathematics.
- Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.

* Course Policies
** Etiquette
- Please be considerate about everyone's time.
- In all emails pertaining to this course, please have "ES221" in the subject line.
	- (note that there is no space or hyphen or anything between ES and 221)

** Cheating
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.

** Grading
Following will be the weightage of different components of assessment
| Component            | Weightage |
|----------------------+-----------|
| Homework assignments |       20% |
| In-class submissions |       25% |
| Tutorials            |       25% |
| Exams (two)          |  15% each |

** Modes of formal assessment
- Tutorials will involve two types of problems:
  - Set A: to be submitted within the tutorial session and will be graded towards Tutorial weightage
  - Set B: to be practiced outside the tutorial hour and will not be graded
- Assignments will entail analysis/practical problems, reports, etc. and may be individual or group
- Expect one assignment and tutorial per week.
- All assignments and tutorials can be downloaded from [[https://drive.google.com/drive/folders/11yCs_XVtDW0ATJPo-Vr_x_4C3R2DEiWw?usp=sharing][this google folder]].
	
** Emphasis on self-learning
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.

* Calendar (tentative)
** [L1] Aug 05, Tue
- Introduction to the subject, solids vs. fluids, rigidity vs. flexibility. Failure modes of solids.
- Review (self) of class XI topics:
  - Fundamental vs. derived quantities, dimensional analysis.
  - SI units (base and derived).
  - Significant figures and scientific notation, rounding off.
  - Newton's laws of motion - first, second and third.
  - Force systems - coplanar, collinear, concurrent.
  - Moment of force.
  - Resultant force and moment. Equations of static equilibrium.
  - /Reading from the book (B1)/: Chapters 1-4.
** [T1] Aug 06, Wed
- Review of topics from Class XI.
