306.3_ES221_Fall2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-31 Fri 05:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ES 221: Mechanics of Solids - Fall 2025</title>
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='gs_simple.css' />
</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content" class="content">
<h1 class="title">ES 221: Mechanics of Solids - Fall 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc923ad3">Basic Information</a></li>
<li><a href="#org27cda33">Course objectives, syllabus, books, pre-requisites</a></li>
<li><a href="#org5340be2">Course Policies</a></li>
<li><a href="#org57c8bfd">Calendar (tentative)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc923ad3" class="outline-2">
<h2 id="orgc923ad3">Basic Information</h2>
<div class="outline-text-2" id="text-orgc923ad3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class timings</th>
<th scope="col" class="org-left">G1, G2: Tuesday, Friday, 11:30-12:50 hrs</th>
</tr>

<tr>
<th scope="col" class="org-left">Class location</th>
<th scope="col" class="org-left">AB 7/101</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tutorial timings</td>
<td class="org-left">Wednesday, 21:00-22:20 hrs</td>
</tr>

<tr>
<td class="org-left">Tutorial location</td>
<td class="org-left">AB 7/101</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TAs</td>
<td class="org-left">Yajat Sharma (yajat.sharma@iitgn.ac.in)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Kritika Rai (kritika.rai@iitgn.ac.in)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org27cda33" class="outline-2">
<h2 id="org27cda33">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-org27cda33">
</div>
<div id="outline-container-org3b5dbec" class="outline-3">
<h3 id="org3b5dbec">Objectives</h3>
<div class="outline-text-3" id="text-org3b5dbec">
<ul class="org-ul">
<li>To learn how materials behave in engineering applications.</li>
<li>To learn how small and large natural and engineered systems remain stable/fail.</li>
<li>To get an idea about design and analysis of different systems such as dams, buildings, bridges, etc.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb53fe02" class="outline-3">
<h3 id="orgb53fe02">Syllabus</h3>
<div class="outline-text-3" id="text-orgb53fe02">
<ul class="org-ul">
<li>Free body diagram, Modeling of supports, Conditions for Equilibrium.</li>
<li>Friction Force-deformation relationship and geometric compatibility (for small deformations) with illustrations through simple problems on axially loaded members and thin walled pressure vessels.</li>
<li>Axial force, shear force, bending moment, and twisting moment diagrams of slender members.</li>
<li>Concept of stress and strain at a point, Transformation of stresses and strain at a point, Principal stresses and strains, Mohr’s circle (only for plane stress and strain case).</li>
<li>Displacement field, Strain Rosette, Modeling of problem as a plane stress or plane strain problem.</li>
<li>Discussion of experimental results on 1-D material behavior.</li>
<li>Concepts of elasticity, plasticity, strain-hardening, failure (fracture/yielding), idealization of 1-D stress-strain curve, Concepts of isotropy, orthotropy, anisotropy.</li>
<li>Generalized Hooke’s law, (without and with thermal strains).</li>
<li>Torsion of circular shafts and thin-walled tubes.</li>
<li>Bending of beams with symmetric cross-section (normal and shear stresses), Combined stresses, Yield criteria, Deflection due to bending.</li>
<li>Integration of the moment-curvature relationship for simple boundary conditions, Super position principle.</li>
<li>Concepts of strain energy and complementary strain energy for simple structural elements (those under axial load, shear force, bending moment, and torsion).</li>
<li>Castigliano’s theorems for deflection analysis and indeterminate problems.</li>
<li>Concept of elastic instability and a brief introduction to column buckling and Euler’s formula.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb652bd" class="outline-3">
<h3 id="orgfb652bd">Textbook</h3>
<div class="outline-text-3" id="text-orgfb652bd">
<ul class="org-ul">
<li><b>B1</b>: Engineering Mechanics: Statics - R.C. Hibbeler (14th edition).</li>
<li><b>B2</b>: Mechanics of Materials - R.C. Hibbeler (10th edition).</li>
</ul>
</div>
</div>

<div id="outline-container-org62859c8" class="outline-3">
<h3 id="org62859c8">Reference Books</h3>
<div class="outline-text-3" id="text-org62859c8">
<ul class="org-ul">
<li>Strength of Materials - S. Timoshenko.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf032a58" class="outline-3">
<h3 id="orgf032a58">Pre-requisites</h3>
<div class="outline-text-3" id="text-orgf032a58">
<ul class="org-ul">
<li>Good background in Mathematics.</li>
<li>Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5340be2" class="outline-2">
<h2 id="org5340be2">Course Policies</h2>
<div class="outline-text-2" id="text-org5340be2">
</div>
<div id="outline-container-orgafd0652" class="outline-3">
<h3 id="orgafd0652">Etiquette</h3>
<div class="outline-text-3" id="text-orgafd0652">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "ES221" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between ES and 221)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6246e0d" class="outline-3">
<h3 id="org6246e0d">Cheating</h3>
<div class="outline-text-3" id="text-org6246e0d">
<p>
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-orgaa36d19" class="outline-3">
<h3 id="orgaa36d19">Grading</h3>
<div class="outline-text-3" id="text-orgaa36d19">
<p>
Following will be the weightage of different components of assessment
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-right">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-right">20%</td>
</tr>

<tr>
<td class="org-left">In-class submissions</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">Tutorials</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">Exams (two)</td>
<td class="org-right">15% each</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org43d3efe" class="outline-3">
<h3 id="org43d3efe">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-org43d3efe">
<ul class="org-ul">
<li>Tutorials will involve two types of problems:
<ul class="org-ul">
<li>Set A: to be submitted within the tutorial session and will be graded towards Tutorial weightage</li>
<li>Set B: to be practiced outside the tutorial hour and will not be graded</li>
</ul></li>
<li>Assignments will entail analysis/practical problems, reports, etc. and may be individual or group</li>
<li>Expect one assignment and tutorial per week.</li>
<li>All assignments and tutorials can be downloaded from <a href="https://drive.google.com/drive/folders/11yCs_XVtDW0ATJPo-Vr_x_4C3R2DEiWw?usp=sharing">this google folder</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3e6b9b" class="outline-3">
<h3 id="orgb3e6b9b">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-orgb3e6b9b">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-org57c8bfd" class="outline-2">
<h2 id="org57c8bfd">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-org57c8bfd">
</div>
<div id="outline-container-orgbb36c36" class="outline-3">
<h3 id="orgbb36c36">[L1] Aug 05, Tue</h3>
<div class="outline-text-3" id="text-orgbb36c36">
<ul class="org-ul">
<li>Introduction to the subject, solids vs. fluids, rigidity vs. flexibility. Failure modes of solids.</li>
<li>Review (self) of class XI topics:
<ul class="org-ul">
<li>Fundamental vs. derived quantities, dimensional analysis.</li>
<li>SI units (base and derived).</li>
<li>Significant figures and scientific notation, rounding off.</li>
<li>Newton's laws of motion - first, second and third.</li>
<li>Force systems - coplanar, collinear, concurrent.</li>
<li>Moment of force.</li>
<li>Resultant force and moment. Equations of static equilibrium.</li>
<li><i>Reading from the book (B1)</i>: Chapters 1-4.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1f97328" class="outline-3">
<h3 id="org1f97328">[T1] Aug 06, Wed</h3>
<div class="outline-text-3" id="text-org1f97328">
<ul class="org-ul">
<li>Review of topics from Class XI.</li>
</ul>
</div>
</div>
