content/306.3_ES221_Fall2025.org
** [L2] Aug 08, Fri
- Moment of a force, couple moment. Equations of static equilibrium vis-a-vis dynamic equilibrium.
- Classification and idealization of systems by resisting action (tie, strut, beam, column, shaft).
- External and internal forces.
- Examples of determining support reactions and internal forces.
- /Reading from the book (B1)/: Chapter 5.
** [L3] Aug 12, Tue
- Idealization of supports - fixed, roller, hinged.
- Two-force members.
- Introduction to truss structures.
- Analysis of pin-jointed trusses by method of joints.
- /Reading from the book (B1)/: Chapters 5 & 6.
** [T2] Aug 13, Wed
# - /In-class submission C1/
- Analysis of pin-jointed trusses.
- /Reading from the book (B1)/: Chapter 6.
** Aug 15, Fri - holiday (Independence Day)
** [L4] Aug 19, Tue
- Classification and idealization of structural members by geometry (1D, 2D, 3D).
- Bending moment and shear forces in beams. Sign conventions for bending moment and shear force.
- /Reading from the book (B1)/: Chapter 7.
** [T3] Aug 20, Wed
- Bending moment and shear force diagrams.
** [L5] Aug 22, Fri
- Bending moment and shear force diagrams. Sign convention for shear force.
- /Reading from the book (B1)/: Chapter 7.
** [L6] Aug 26, Tue
- /Assignment 1/ given (due on 2 Sep).
- Concept of stress. Normal and shear stresses. General state of stress. Sign convention.
- Area as a vector. Average stresses. Examples of finding normal stress.
- /Reading from the book (B2)/: Chapter 1.
** [T4] Aug 27, Wed
- Computation of stresses.
** [L7] Aug 29, Fri
- Concept of strain. Normal and shear strain. General state of strain. Sign convention. Poisson's ratio.
- Average strain. Examples of finding normal strain.
- /Reading from the book (B2)/: Chapter 2.
** [L8] Sep 02, Tue
- /Assignment 2/ given (due on 9 Sep).
- Uniaxial tensile test (useful video: https://www.youtube.com/watch?v=RY9X_O8is-k )
- Material properties. Relations between stress and strain.
- Young's modulus, shear modulus.
- Hooke's law.
- Discussion of terms
  - ductile vs. brittle
  - stiffness vs. strength
  - modulus of resilience and modulus of toughness
- /Reading from the book (B2)/: Chapter 2.
** [T5] Sep 03, Wed
- Material properties. Relations between stress and strain.
** Sep 05, Fri - holiday (Id-e-Milad)
** [L9] Sep 09, Tue
- /Assignment 3/ given (due on 16 Sep).
- Saint Venant principle.
- Axial deformations of a bar.
- Principle of superposition.
- Degree of static indeterminacy; statically indeterminate and determinate system.
- Use of geometric compatibility to solve statically indeterminate systems.
- /Reading from the book (B2)/: Chapter 4.
** [T6] Sep 10, Wed
- Axial deformations of a bar.
** [L10] Sep 12, Fri
- Consideration of temperature changes through coefficient of thermal expansion.
- Positive and negative coefficients of thermal expansion.
- Strain decomposition into mechanical and thermal parts.
- Stresses and strains due to changes in temperature.
- Degree of static indeterminacy; statically indeterminate and determinate system.
- /Reading from the book (B2)/: Chapter 4.
** [L11] Sep 16, Tue
- Consideration of torsion of bars.
- Useful video: https://www.youtube.com/watch?v=1YTKedLQOa0
- Angle of twist, shear strain and stress due to torsion.
- Polar moment of inertia.
- /Reading from the book (B2)/: Chapter 5 and Appendix A.
** [T7] Sep 17, Wed
- Axial deformations and torsion in bars.
** Sep 19 - 26: Mid semester exam week
*** Sep 25, Thu, 14:00-16:00 -- Mid Semester Exam -- AB 11/102
# Marks out of 100: Maximum: 90, Average: 60.67, Standard Deviation: 21.15
** Sep 27 - Oct 05: Mid semester recess
** [L12] Oct 07, Tue
- Refresher on SFD and BMD: https://www.youtube.com/watch?v=C-FEVzI8oe8
- Normal strains and stresses due to bending.
- Derivation of the flexure formula and underlying discussions.
- First and second moments of area.
- /Reading from the book (B1)/: Chapter 10 and Appendix A.
- /Reading from the book (B2)/: Chapter 6.
- /Assignment 4/ given (due on 14 Oct).
# - /In-class submission C2/
** [T8] Oct 08, Wed
- Torsion and uniaxial forces in bars.
** [L13] Oct 10, Fri
- Normal strains and stresses due to bending.
- Determination of neutral axis for simple sections through force balance
- Limits on neutral axis depth through strain diagram; concept of balanced section
- Curvature and moment-curvature relationship; its similarity with force-displacement and torsion-rotation relationship
- Concept of spring constants for different scenarios
- Consideration of composite sections and concept of modular ratio
- /Reading from the book (B2)/: Chapter 6.
** [L14] Oct 14, Tue
- Shear stresses in beams. Shear formula.
- Transverse and longitudinal shear stress.
- /Reading from the book (B2)/: Chapter 7.
- /Assignment 5/ given (due on 21 Oct).
** [T9] Oct 15, Wed
- Shear stresses in beams.
** [L15] Oct 17, Fri
- Combined states of stresses.
- Consideration of thin-walled pressure vessels.
- /Reading from the book (B2)/: Chapter 8.
** [L16] Oct 21, Tue
- Stress at a point.
- Sign conventions for positive/negative planes and positive/negative stresses.
- Transformation of stresses in 2D.
- /Reading from the book (B2)/: Chapter 9.
** [T10] Oct 22, Wed
- Transformation of stress in 2D.
** [L17] Oct 24, Fri
- Transformation of stresses in 2D.
- /Reading from the book (B2)/: Chapter 9.
