306.3_ES221_Fall2025.html
<div id="outline-container-orga5cc1b4" class="outline-3">
<h3 id="orga5cc1b4">[L2] Aug 08, Fri</h3>
<div class="outline-text-3" id="text-orga5cc1b4">
<ul class="org-ul">
<li>Moment of a force, couple moment. Equations of static equilibrium vis-a-vis dynamic equilibrium.</li>
<li>Classification and idealization of systems by resisting action (tie, strut, beam, column, shaft).</li>
<li>External and internal forces.</li>
<li>Examples of determining support reactions and internal forces.</li>
<li><i>Reading from the book (B1)</i>: Chapter 5.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb106128" class="outline-3">
<h3 id="orgb106128">[L3] Aug 12, Tue</h3>
<div class="outline-text-3" id="text-orgb106128">
<ul class="org-ul">
<li>Idealization of supports - fixed, roller, hinged.</li>
<li>Two-force members.</li>
<li>Introduction to truss structures.</li>
<li>Analysis of pin-jointed trusses by method of joints.</li>
<li><i>Reading from the book (B1)</i>: Chapters 5 &amp; 6.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc061d1" class="outline-3">
<h3 id="orgbc061d1">[T2] Aug 13, Wed</h3>
<div class="outline-text-3" id="text-orgbc061d1">
<ul class="org-ul">
<li>Analysis of pin-jointed trusses.</li>
<li><i>Reading from the book (B1)</i>: Chapter 6.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc043f87" class="outline-3">
<h3 id="orgc043f87">Aug 15, Fri - holiday (Independence Day)</h3>
</div>
<div id="outline-container-orgcf9a89f" class="outline-3">
<h3 id="orgcf9a89f">[L4] Aug 19, Tue</h3>
<div class="outline-text-3" id="text-orgcf9a89f">
<ul class="org-ul">
<li>Classification and idealization of structural members by geometry (1D, 2D, 3D).</li>
<li>Bending moment and shear forces in beams. Sign conventions for bending moment and shear force.</li>
<li><i>Reading from the book (B1)</i>: Chapter 7.</li>
</ul>
</div>
</div>
<div id="outline-container-org3b75b7a" class="outline-3">
<h3 id="org3b75b7a">[T3] Aug 20, Wed</h3>
<div class="outline-text-3" id="text-org3b75b7a">
<ul class="org-ul">
<li>Bending moment and shear force diagrams.</li>
</ul>
</div>
</div>
<div id="outline-container-org4381e83" class="outline-3">
<h3 id="org4381e83">[L5] Aug 22, Fri</h3>
<div class="outline-text-3" id="text-org4381e83">
<ul class="org-ul">
<li>Bending moment and shear force diagrams. Sign convention for shear force.</li>
<li><i>Reading from the book (B1)</i>: Chapter 7.</li>
</ul>
</div>
</div>
<div id="outline-container-org0990972" class="outline-3">
<h3 id="org0990972">[L6] Aug 26, Tue</h3>
<div class="outline-text-3" id="text-org0990972">
<ul class="org-ul">
<li><i>Assignment 1</i> given (due on 2 Sep).</li>
<li>Concept of stress. Normal and shear stresses. General state of stress. Sign convention.</li>
<li>Area as a vector. Average stresses. Examples of finding normal stress.</li>
<li><i>Reading from the book (B2)</i>: Chapter 1.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e0a553" class="outline-3">
<h3 id="org7e0a553">[T4] Aug 27, Wed</h3>
<div class="outline-text-3" id="text-org7e0a553">
<ul class="org-ul">
<li>Computation of stresses.</li>
</ul>
</div>
</div>
<div id="outline-container-org9aab2cc" class="outline-3">
<h3 id="org9aab2cc">[L7] Aug 29, Fri</h3>
<div class="outline-text-3" id="text-org9aab2cc">
<ul class="org-ul">
<li>Concept of strain. Normal and shear strain. General state of strain. Sign convention. Poisson's ratio.</li>
<li>Average strain. Examples of finding normal strain.</li>
<li><i>Reading from the book (B2)</i>: Chapter 2.</li>
</ul>
</div>
</div>
<div id="outline-container-org16389f1" class="outline-3">
<h3 id="org16389f1">[L8] Sep 02, Tue</h3>
<div class="outline-text-3" id="text-org16389f1">
<ul class="org-ul">
<li><i>Assignment 2</i> given (due on 9 Sep).</li>
<li>Uniaxial tensile test (useful video: <a href="https://www.youtube.com/watch?v=RY9X_O8is-k">https://www.youtube.com/watch?v=RY9X_O8is-k</a> )</li>
<li>Material properties. Relations between stress and strain.</li>
<li>Young's modulus, shear modulus.</li>
<li>Hooke's law.</li>
<li>Discussion of terms
<ul class="org-ul">
<li>ductile vs. brittle</li>
<li>stiffness vs. strength</li>
<li>modulus of resilience and modulus of toughness</li>
</ul></li>
<li><i>Reading from the book (B2)</i>: Chapter 2.</li>
</ul>
</div>
</div>
<div id="outline-container-org9b4ac80" class="outline-3">
<h3 id="org9b4ac80">[T5] Sep 03, Wed</h3>
<div class="outline-text-3" id="text-org9b4ac80">
<ul class="org-ul">
<li>Material properties. Relations between stress and strain.</li>
</ul>
</div>
</div>
<div id="outline-container-org1c489f5" class="outline-3">
<h3 id="org1c489f5">Sep 05, Fri - holiday (Id-e-Milad)</h3>
</div>
<div id="outline-container-orgd934996" class="outline-3">
<h3 id="orgd934996">[L9] Sep 09, Tue</h3>
<div class="outline-text-3" id="text-orgd934996">
<ul class="org-ul">
<li><i>Assignment 3</i> given (due on 16 Sep).</li>
<li>Saint Venant principle.</li>
<li>Axial deformations of a bar.</li>
<li>Principle of superposition.</li>
<li>Degree of static indeterminacy; statically indeterminate and determinate system.</li>
<li>Use of geometric compatibility to solve statically indeterminate systems.</li>
<li><i>Reading from the book (B2)</i>: Chapter 4.</li>
</ul>
</div>
</div>
<div id="outline-container-org00e8939" class="outline-3">
<h3 id="org00e8939">[T6] Sep 10, Wed</h3>
<div class="outline-text-3" id="text-org00e8939">
<ul class="org-ul">
<li>Axial deformations of a bar.</li>
</ul>
</div>
</div>
<div id="outline-container-orgabbdff3" class="outline-3">
<h3 id="orgabbdff3">[L10] Sep 12, Fri</h3>
<div class="outline-text-3" id="text-orgabbdff3">
<ul class="org-ul">
<li>Consideration of temperature changes through coefficient of thermal expansion.</li>
<li>Positive and negative coefficients of thermal expansion.</li>
<li>Strain decomposition into mechanical and thermal parts.</li>
<li>Stresses and strains due to changes in temperature.</li>
<li>Degree of static indeterminacy; statically indeterminate and determinate system.</li>
<li><i>Reading from the book (B2)</i>: Chapter 4.</li>
</ul>
</div>
</div>
<div id="outline-container-org74c906b" class="outline-3">
<h3 id="org74c906b">[L11] Sep 16, Tue</h3>
<div class="outline-text-3" id="text-org74c906b">
<ul class="org-ul">
<li>Consideration of torsion of bars.</li>
<li>Useful video: <a href="https://www.youtube.com/watch?v=1YTKedLQOa0">https://www.youtube.com/watch?v=1YTKedLQOa0</a></li>
<li>Angle of twist, shear strain and stress due to torsion.</li>
<li>Polar moment of inertia.</li>
<li><i>Reading from the book (B2)</i>: Chapter 5 and Appendix A.</li>
</ul>
</div>
</div>
<div id="outline-container-orga2a4d8a" class="outline-3">
<h3 id="orga2a4d8a">[T7] Sep 17, Wed</h3>
<div class="outline-text-3" id="text-orga2a4d8a">
<ul class="org-ul">
<li>Axial deformations and torsion in bars.</li>
</ul>
</div>
</div>
<div id="outline-container-org0610176" class="outline-3">
<h3 id="org0610176">Sep 19 - 26: Mid semester exam week</h3>
<div class="outline-text-3" id="text-org0610176">
</div>
<div id="outline-container-orgb0b22e7" class="outline-4">
<h4 id="orgb0b22e7">Sep 25, Thu, 14:00-16:00 &#x2013; Mid Semester Exam &#x2013; AB 11/102</h4>
<div class="outline-text-4" id="text-orgb0b22e7">
</div>
</div>
</div>
<div id="outline-container-org84a6b47" class="outline-3">
<h3 id="org84a6b47">Sep 27 - Oct 05: Mid semester recess</h3>
</div>
<div id="outline-container-orgab1ae5f" class="outline-3">
<h3 id="orgab1ae5f">[L12] Oct 07, Tue</h3>
<div class="outline-text-3" id="text-orgab1ae5f">
<ul class="org-ul">
<li>Refresher on SFD and BMD: <a href="https://www.youtube.com/watch?v=C-FEVzI8oe8">https://www.youtube.com/watch?v=C-FEVzI8oe8</a></li>
<li>Normal strains and stresses due to bending.</li>
<li>Derivation of the flexure formula and underlying discussions.</li>
<li>First and second moments of area.</li>
<li><i>Reading from the book (B1)</i>: Chapter 10 and Appendix A.</li>
<li><i>Reading from the book (B2)</i>: Chapter 6.</li>
<li><i>Assignment 4</i> given (due on 14 Oct).</li>
</ul>
</div>
</div>
<div id="outline-container-orga8924df" class="outline-3">
<h3 id="orga8924df">[T8] Oct 08, Wed</h3>
<div class="outline-text-3" id="text-orga8924df">
<ul class="org-ul">
<li>Torsion and uniaxial forces in bars.</li>
</ul>
</div>
</div>
<div id="outline-container-orgab2803d" class="outline-3">
<h3 id="orgab2803d">[L13] Oct 10, Fri</h3>
<div class="outline-text-3" id="text-orgab2803d">
<ul class="org-ul">
<li>Normal strains and stresses due to bending.</li>
<li>Determination of neutral axis for simple sections through force balance</li>
<li>Limits on neutral axis depth through strain diagram; concept of balanced section</li>
<li>Curvature and moment-curvature relationship; its similarity with force-displacement and torsion-rotation relationship</li>
<li>Concept of spring constants for different scenarios</li>
<li>Consideration of composite sections and concept of modular ratio</li>
<li><i>Reading from the book (B2)</i>: Chapter 6.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaaaa343" class="outline-3">
<h3 id="orgaaaa343">[L14] Oct 14, Tue</h3>
<div class="outline-text-3" id="text-orgaaaa343">
<ul class="org-ul">
<li>Shear stresses in beams. Shear formula.</li>
<li>Transverse and longitudinal shear stress.</li>
<li><i>Reading from the book (B2)</i>: Chapter 7.</li>
<li><i>Assignment 5</i> given (due on 21 Oct).</li>
</ul>
</div>
</div>
<div id="outline-container-orga98b2ff" class="outline-3">
<h3 id="orga98b2ff">[T9] Oct 15, Wed</h3>
<div class="outline-text-3" id="text-orga98b2ff">
<ul class="org-ul">
<li>Shear stresses in beams.</li>
</ul>
</div>
</div>
<div id="outline-container-org8d003d3" class="outline-3">
<h3 id="org8d003d3">[L15] Oct 17, Fri</h3>
<div class="outline-text-3" id="text-org8d003d3">
<ul class="org-ul">
<li>Combined states of stresses.</li>
<li>Consideration of thin-walled pressure vessels.</li>
<li><i>Reading from the book (B2)</i>: Chapter 8.</li>
</ul>
</div>
</div>
<div id="outline-container-org1530ad4" class="outline-3">
<h3 id="org1530ad4">[L16] Oct 21, Tue</h3>
<div class="outline-text-3" id="text-org1530ad4">
<ul class="org-ul">
<li>Stress at a point.</li>
<li>Sign conventions for positive/negative planes and positive/negative stresses.</li>
<li>Transformation of stresses in 2D.</li>
<li><i>Reading from the book (B2)</i>: Chapter 9.</li>
<li><i>Assignment 6</i> given (due on 28 Oct).</li>
</ul>
</div>
</div>
